<a href="https://colab.research.google.com/github/icehongsi/2020_Fall/blob/master/%ED%99%8D%EC%98%81%EC%A3%BC_homework0_aws_mysql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework 0: AWS MySQL

1. Create AWS account (Recommend to use AWS Educate Program)
2. Create AWS RDS mysql instance
3. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Restart kernel and run all. (Runtime-> restart and run all)
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homework is accepted for any reasons!

In [1]:
%load_ext sql

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/1a/ea/dd9c81e2d85efd03cfbf808736dd055bd9ea1a78aea9968888b1055c3263/PyMySQL-0.10.1-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 1.6MB/s
Installing collected packages: pymysql
Successfully installed pymysql-0.10.1

## You must use your own host name, not mine, not someone else
## You must use your user name and password, not mine.

In [3]:
import getpass
user = 'hong'
password = getpass.getpass()
host='database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: hong@'

## Create companydb and load data
## Whenever database is corrupted, run this cell

In [4]:
%%sql

SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP DATABASE IF EXISTS companydb;
CREATE DATABASE IF NOT EXISTS companydb;
USE companydb;

DROP TABLE IF EXISTS DEPENDENT;
DROP TABLE IF EXISTS WORKS_ON;
DROP TABLE IF EXISTS PROJECT;
DROP TABLE IF EXISTS DEPT_LOCATIONS;
DROP TABLE IF EXISTS DEPARTMENT;
DROP TABLE IF EXISTS EMPLOYEE;

CREATE TABLE EMPLOYEE
(       Fname VARCHAR(15) NOT NULL,
        Minit CHAR,
        Lname VARCHAR(15) NOT NULL,
        Ssn CHAR(9) NOT NULL,
        Bdate DATE,
        Address VARCHAR(30),
        Sex CHAR,
        Salary DECIMAL(10, 2),
        Superssn CHAR(9),
        Dno INT,
        PRIMARY KEY (Ssn),
        FOREIGN KEY (Superssn) 
                REFERENCES EMPLOYEE(Ssn) 
                ON DELETE SET NULL
                ON UPDATE CASCADE,
        FOREIGN KEY (Dno) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPARTMENT
(       Dname VARCHAR(15) NOT NULL,
        Dnumber INT NOT NULL,
        Mgrssn CHAR(9),
        Mgrstartdate DATE,
        PRIMARY KEY (Dnumber),
        UNIQUE (Dname),
        FOREIGN KEY (Mgrssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPT_LOCATIONS
(       Dnumber INT NOT NULL,
        Dlocation VARCHAR(15) NOT NULL,
        PRIMARY KEY (Dnumber, Dlocation),
        FOREIGN KEY (Dnumber)
                REFERENCES DEPARTMENT(Dnumber) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE PROJECT
(       Pname VARCHAR(15) NOT NULL,
        Pnumber INT NOT NULL,
        Plocation VARCHAR(15),
        Dnum INT,
        PRIMARY KEY (Pnumber),
        UNIQUE (Pname),
        FOREIGN KEY (Dnum) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE WORKS_ON
(       Essn CHAR(9) NOT NULL,
        Pno INT NOT NULL,
        Hours DECIMAL(3, 1) ,
        PRIMARY KEY (Essn, Pno),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Pno) 
                REFERENCES PROJECT(Pnumber)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPENDENT
(       Essn CHAR(9) NOT NULL,
        Dependent_name VARCHAR(15) NOT NULL,
        Sex CHAR,
        Bdate DATE,
        Relationship VARCHAR(8),
        PRIMARY KEY (Essn, Dependent_name),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


insert into EMPLOYEE values
        ("John", "B", "Smith", "123456789","1965-01-09", "731-Fondren-Houston-TX", "M", 30000, "333445555", 5),
        ("Franklin", "T", "Wong", "333445555","1955-12-08", "638-Voss-Houston-TX", "M", 40000, "888665555", 5),
        ("Alicia", "J", "Zelaya", "999887777", "1968-01-19", "3321-Castle-Spring-TX", "F", 25000, "987654321", 4),
        ("Jennifer", "S", "Wallace", "987654321", "1941-06-20", "291-Berry-Bellaire-TX", "F", 43000, "888665555", 4),
        ("Ramesh", "K", "Narayan", "666884444", "1962-09-15", "975-Fire-Oak-Humble-TX", "M", 38000, "333445555", 5),
        ("Joyce", "A", "English", "453453453", "1972-07-31", "5631-Rice-Houston-TX", "F", 25000, "333445555", 5),
        ("Ahmad", "V", "Jabbar", "987987987", "1969-03-29", "980-Dallas-Houston-TX", "M", 25000, "987654321", 4),
        ("James", "E", "Borg", "888665555", "1937-11-10", "450-Stone-Houston-TX", "M", 55000, NULL, 1);


insert into DEPENDENT  values 
        (333445555, "Alice", "F","1986-04-05", "Daughter"),
        (333445555, "Theodore", "M","1983-10-25", "Son"),
        (333445555, "Joy", "F","1958-05-03", "Spouse"),
        (987654321, "Abner", "M","1942-02-28", "Spouse"),
        (123456789, "Michael", "M","1988-01-04", "Son"),
        (123456789, "Alice", "F", "1988-12-30", "Daughter"),
        (123456789, "Elizabeth", "F", "1967-05-05", "Spouse");


insert into DEPARTMENT values 
        ("Research", 5, 333445555,"1988-05-22"),
        ("Administration", 4, 987654321,"1995-01-01"),
        ("Headquarters", 1, 888665555,"1981-06-19");

insert into DEPT_LOCATIONS values 
        (1, "Houston"),
        (4, "Stafford"),
        (5, "Bellaire"),
        (5, "Sugarland"),
        (5, "Houston");


insert into PROJECT values 
        ("ProductX", 1, "Bellaire", 5),
        ("ProductY", 2, "Sugarland", 5),
        ("ProductZ", 3, "Houston", 5),
        ("Computerization", 10, "Stafford", 4),
        ("Reorganization", 20, "Houston", 1),
        ("Newbenefits", 30, "Stafford", 4);


insert into WORKS_ON values
        (123456789, 1, 32.5),
        (123456789, 2, 7.5),
        (666884444, 3, 40.0),
        (453453453, 1, 20.0),
        (453453453, 2, 20.0),
        (333445555, 2, 10.0),
        (333445555, 3, 10.0),
        (333445555, 10, 10.0),
        (333445555, 20, 10.0),
        (999887777, 30, 30.0),
        (999887777, 10, 10.0),
        (987987987, 10, 35.0),
        (987987987, 30, 5.0),
        (987654321, 30, 20.0),
        (987654321, 20, 15.0),
        (888665555, 20, NULL); 

SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
6 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
7 rows affected.
3 rows affected.
5 rows affected.
6 rows affected.
16 rows affected.
0 rows affected.
0 rows affected.

[]

## Check if everything is done successfully

In [5]:
%sql show databases;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('companydb',), ('information_schema',), ('mysql',), ('performance_schema',)]

In [6]:
%sql show tables;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('EMPLOYEE',),
 ('PROJECT',),
 ('WORKS_ON',)]

In [7]:
%sql select * from EMPLOYEE;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [8]:
%sql select * from DEPENDENT;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('123456789', 'Alice', 'F', datetime.date(1988, 12, 30), 'Daughter'),
 ('123456789', 'Elizabeth', 'F', datetime.date(1967, 5, 5), 'Spouse'),
 ('123456789', 'Michael', 'M', datetime.date(1988, 1, 4), 'Son'),
 ('333445555', 'Alice', 'F', datetime.date(1986, 4, 5), 'Daughter'),
 ('333445555', 'Joy', 'F', datetime.date(1958, 5, 3), 'Spouse'),
 ('333445555', 'Theodore', 'M', datetime.date(1983, 10, 25), 'Son'),
 ('987654321', 'Abner', 'M', datetime.date(1942, 2, 28), 'Spouse')]

In [9]:
%sql select * from DEPARTMENT;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1981, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1995, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1988, 5, 22))]

In [10]:
%sql select * from DEPT_LOCATIONS;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[(1, 'Houston'),
 (4, 'Stafford'),
 (5, 'Bellaire'),
 (5, 'Houston'),
 (5, 'Sugarland')]

In [11]:
%sql select * from PROJECT;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('ProductX', 1, 'Bellaire', 5),
 ('ProductY', 2, 'Sugarland', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4)]

In [12]:
%sql select * from WORKS_ON;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
16 rows affected.

[('123456789', 1, Decimal('32.5')),
 ('123456789', 2, Decimal('7.5')),
 ('333445555', 2, Decimal('10.0')),
 ('333445555', 3, Decimal('10.0')),
 ('333445555', 10, Decimal('10.0')),
 ('333445555', 20, Decimal('10.0')),
 ('453453453', 1, Decimal('20.0')),
 ('453453453', 2, Decimal('20.0')),
 ('666884444', 3, Decimal('40.0')),
 ('888665555', 20, None),
 ('987654321', 20, Decimal('15.0')),
 ('987654321', 30, Decimal('20.0')),
 ('987987987', 10, Decimal('35.0')),
 ('987987987', 30, Decimal('5.0')),
 ('999887777', 10, Decimal('10.0')),
 ('999887777', 30, Decimal('30.0'))]

# DO NOT EDIT THIS:

SCORE: